Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_12 (LSTM)               (None, None, 512)         1193984   
_________________________________________________________________
batch_normalization_12 (Batc (None, None, 512)         2048      
_________________________________________________________________
dropout_12 (Dropout)         (None, None, 512)         0         
_________________________________________________________________
lstm_13 (LSTM)               (None, None, 512)         2099200   
_________________________________________________________________
batch_normalization_13 (Batc (None, None, 512)         2048      
_________________________________________________________________
dropout_13 (Dropout)         (None, None, 512)         0         
_________________________________________________________________
lstm_14 (LSTM)               (None, None, 256)         787456    
_________________________________________________________________
batch_normalization_14 (Batc (None, None, 256)         1024      
_________________________________________________________________
dropout_14 (Dropout)         (None, None, 256)         0         
_________________________________________________________________
lstm_15 (LSTM)               (None, None, 128)         197120    
_________________________________________________________________
batch_normalization_15 (Batc (None, None, 128)         512       
_________________________________________________________________
dropout_15 (Dropout)         (None, None, 128)         0         
_________________________________________________________________
lstm_16 (LSTM)               (None, None, 64)          49408     
_________________________________________________________________
batch_normalization_16 (Batc (None, None, 64)          256       
_________________________________________________________________
dropout_16 (Dropout)         (None, None, 64)          0         
_________________________________________________________________
lstm_17 (LSTM)               (None, 32)                12416     
_________________________________________________________________
batch_normalization_17 (Batc (None, 32)                128       
_________________________________________________________________
dropout_17 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                330       
=================================================================
Total params: 4,345,930
Trainable params: 4,342,922
Non-trainable params: 3,008
_________________________________________________________________
